{
  "architectures": [
    "Qwen3_5ForCausalLM"
  ],
  "model_type": "qwen3_5",
  "hidden_size": 2560,
  "num_hidden_layers": 32,
  "num_attention_heads": 16,
  "num_key_value_heads": 4,
  "vocab_size": 248320,
  "quant_method": "awq",
  "quantization": {
    "group_size": 64,
    "bits": 4,
    "mode": "affine"
  }
}
