{
  "architectures": [
    "Qwen3_5ForConditionalGeneration"
  ],
  "model_type": "qwen3_5",
  "dtype": "bfloat16",
  "text_config": {
    "model_type": "qwen3_5_text",
    "hidden_size": 2560,
    "num_hidden_layers": 32,
    "num_attention_heads": 16,
    "num_key_value_heads": 4,
    "vocab_size": 248320
  },
  "vision_config": {
    "hidden_size": 1024,
    "depth": 24
  }
}
