{
  "architectures": [
    "Qwen3_5ForCausalLM"
  ],
  "model_type": "qwen3_5_moe",
  "text_config": {
    "model_type": "qwen3_5_moe",
    "hidden_size": 4096,
    "num_hidden_layers": 48,
    "num_attention_heads": 32,
    "num_key_value_heads": 8,
    "num_experts": 128,
    "num_experts_per_tok": 8,
    "vocab_size": 248320
  },
  "quantization": {
    "group_size": 64,
    "bits": 6,
    "mode": "affine"
  }
}
